<?php
// +----------------------------------------------------------------------
// | 域名停靠系统 v1.0.0
// +----------------------------------------------------------------------
// | 版权所有 2018~2118 开源代码 [ http://www.mypark.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.mypark.com
// +----------------------------------------------------------------------
// | 作者: 无名小二
// +----------------------------------------------------------------------
/*
 * 全局公共文件
*/

//初始 session
if (!session_id()) session_start();
//载入系统基础类
$_cp = new cp();
//载入全局控制器总类
$_app = new app();
//处理Cookie没有HttpOnly标志
ini_set("session.cookie_httponly", 1);

//系统配置全局化
define('DATA', file_get_contents(PATH . '/cmspro/data.cmspro')); 
//数据库表前缀
$_tb = DB_PREFIX;

//全局配置信息
$_data = unserialize(DATA);
$_data['sys']['count'] = base64_decode($_data['sys']['count']);