<?php

// +----------------------------------------------------------------------
// | 域名停靠系统 v2017
// +----------------------------------------------------------------------
// | 版权所有 2016~2018 开源代码 [ http://www.mypark.com ]
// +----------------------------------------------------------------------
// | 官方网站：http://www.mypark.com
// +----------------------------------------------------------------------
// | 作者: 无名小二
// +----------------------------------------------------------------------
if ($_SESSION['admin'] > 0) {
    header('Location:/' . cp::url()[2] . '/index');
}
if (@$_GET['do'] == 'validation') {
    if ($_POST['password'] == null) {
        exit('密码不能为空！');
    }
    if ($_POST['password'] == $_data['sys']['admin']) {
        $_SESSION['admin'] = 1;
        exit('登录成功! <script>location.href="/'.cp::url()[1] . '/index";</script>');
    } else {
        exit('密码错误！');
    }
}